{
    "streetLevel": {
      "description": "Under the neon-lit night sky, you stand before NeoTech Corp's skyscraper, its glass and steel facade reflecting the city's electric glow. Security drones hum menacingly above, their red lights scanning the area.",
      "image": "assets/images/street-level.jpg",
      "exits": { "north": "lobby" },
      "items": []
    },
    "lobby": {
      "description": "The lobby stretches out in a sleek expanse of polished chrome and cold marble. Behind the imposing reception desk, security personnel cast suspicious glances your way, their hands resting near their holsters.",
      "exits": { "south": "streetLevel", "east": "elevatorLobby", "west": "securityOffice" },
      "items": [],
      "npcs": ["receptionist"]
    },
    "elevatorLobby": {
      "description": "Under the harsh, sterile lights, a bank of elevators stands ready, their doors sealed tight. A retinal scanner pulses softly, awaiting authorization.",
      "exits": { "west": "lobby", "up": "employeeLounge" },
      "items": [],
      "requiredItems": { "up": ["keycard"] },
      "deathMessages": { "up": "You try the elevator without a keycard. Alarms blare, and security drags you away." }
    },
    "securityOffice": {
      "description": "The air is thick with the scent of ozone and overheated electronics in this cramped office. Monitors flicker erratically, displaying grainy camera feeds, while a control panel hums a low, steady tune.",
      "exits": { "east": "lobby" },
      "items": ["keycard"],
      "itemUse": {
        "hackersLaptop": {
          "message": "You hack the security system, disabling cameras for a short time.",
          "setState": { "camerasDisabled": true }
        }
      }
    },
    "employeeLounge": {
      "description": "Worn couches and the faint aroma of synthetic coffee define this cozy lounge. Vending machines dispense glowing snacks, and holo-screens flicker with newsfeeds as employees murmur in hushed tones.",
      "exits": { "down": "elevatorLobby", "north": "cafeteria" },
      "items": [],
      "npcs": ["janitor"]
    },
    "cafeteria": {
      "description": "The air is thick with the tangy scent of synth-food in this bustling cafeteria. Workers hunch over their meals at tables that pulse with a soft, blue light, their conversations a low hum.",
      "exits": { "south": "employeeLounge", "east": "breakRoom" },
      "items": ["droneJammer"]
    },
    "breakRoom": {
      "description": "In this small, dimly lit room, a coffee machine gurgles sporadically, and a neon sign flickers erratically, casting eerie shadows. The silence is almost palpable.",
      "exits": { "west": "cafeteria", "north": "itDepartment" },
      "items": []
    },
    "itDepartment": {
      "description": "Cables writhe across the floor like digital serpents in this cluttered office. Terminals blink with lines of code, their screens a kaleidoscope of green and black.",
      "exits": { "south": "breakRoom", "east": "serverRoom" },
      "items": ["smartGlasses"]
    },
    "serverRoom": {
      "description": "The chill bites at your skin as you enter the server room, where rows of servers stand like silent sentinels, humming a monotonous tune. A lone terminal glows, promising control over the building's secrets.",
      "exits": { "west": "itDepartment", "north": "networkingCloset" },
      "items": [],
      "itemUse": {
        "hackersLaptop": {
          "message": "You hack the access controls, unlocking all floors.",
          "setState": { "accessGranted": true }
        }
      }
    },
    "networkingCloset": {
      "description": "Heat radiates from the packed routers and switches in this tight, claustrophobic space. The incessant blinking of lights and the cacophony of cooling fans assault your senses.",
      "exits": { "south": "serverRoom", "up": "researchLabA" },
      "items": [],
      "requiredItems": { "up": ["keycard"] },
      "deathMessages": { "up": "You lack access. An alarm triggers, and drones swarm you." }
    },
    "researchLabA": {
      "description": "Holo-displays flicker with complex schematics, and robotic arms move with precision, assembling intricate tech in this buzzing lab. The air crackles with innovation.",
      "exits": { "down": "networkingCloset", "east": "researchLabB" },
      "items": ["empGrenade"]
    },
    "researchLabB": {
      "description": "Scientists clad in bulky exosuits hunch over workbenches, tinkering with cybernetic implants. Armed guards patrol the perimeter, their eyes scanning for any sign of intrusion.",
      "exits": { "west": "researchLabA", "north": "researchLabC" },
      "items": []
    },
    "researchLabC": {
      "description": "In the heart of the lab, the prototype AI chip rests within a fortified case, its surface shimmering under the lab's lights. Biometric scanners stand as silent guardians, their sensors ever watchful.",
      "exits": { "south": "researchLabB", "up": "executiveSuite" },
      "items": ["dataChip"],
      "requiredItems": { "dataChip": ["biometricSpoofer"] },
      "deathMessages": { "dataChip": "The scanner detects you. Alarms sound, and drones eliminate you." }
    },
    "executiveSuite": {
      "description": "Plush carpets muffle your footsteps as you enter the executive suite, where floor-to-ceiling windows offer a breathtaking view of the sprawling cityscape below. Every detail screams luxury.",
      "exits": { "down": "researchLabC", "north": "boardroom" },
      "items": ["laserCutter"]
    },
    "boardroom": {
      "description": "A massive table of polished obsidian dominates the boardroom, surrounded by chairs that have witnessed countless power plays. Holo-projectors stand ready to display the fate of empires.",
      "exits": { "south": "executiveSuite", "up": "rooftopHelipad" },
      "items": [],
      "npcs": ["securityGuard"]
    },
    "rooftopHelipad": {
      "description": "Wind howls across the exposed helipad, tugging at your clothes. A sleek chopper sits poised for takeoff, its rotors slowly spinning up as your escape beckons.",
      "exits": { "down": "boardroom" },
      "items": []
    },
    "basementGenerators": {
      "description": "The air vibrates with the deep rumble of massive generators in this dimly lit basement. Pipes and conduits snake along the walls, and the scent of oil hangs heavy.",
      "exits": { "east": "maintenanceWorkshop" },
      "items": ["nanotechRepairKit"]
    },
    "maintenanceWorkshop": {
      "description": "Tools of every description and spare parts in various states of repair clutter this workshop. A rickety ladder leans against the wall, promising access to the floors above.",
      "exits": { "west": "basementGenerators", "up": "lobby" },
      "items": ["cloakingDevice"]
    },
    "reception": {
      "description": "A secondary desk, buried under a mountain of paperwork, serves as the visitor check-in. The receptionist looks harried, shuffling through forms with practiced indifference.",
      "exits": { "north": "lobby" },
      "items": []
    },
    "storageRoom": {
      "description": "Dust motes dance in the stale air of this forgotten storeroom, where crates of obsolete tech lie abandoned, their contents long since outdated.",
      "exits": { "south": "serverRoom" },
      "items": ["biometricSpoofer"]
    }
  }